---
kind: type
id: T:Autodesk.Revit.DB.SketchedStairsCurveData
source: html/db3920d1-6efe-0ed4-f951-4d69c254cc6c.htm
---
# Autodesk.Revit.DB.SketchedStairsCurveData

Sketched run/landing curves overrides with height and slope

## Syntax (C#)
```csharp
public class SketchedStairsCurveData : IDisposable
```